# Interacting with Databases

In [1]:
import numpy as np
import pandas as pd

## 1. Creating a SQLite database

In [2]:
import sqlite3

In [3]:
query = '''
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER);
'''

In [4]:
connection = sqlite3.connect('04_database.sqlite')

In [ ]:
connection.execute(query)

In [6]:
connection.commit()

In [7]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahasse', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [8]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [9]:
connection.executemany(stmt, data)

In [10]:
connection.commit()

In [11]:
cursor = connection.execute('select * from test')

In [12]:
rows = cursor.fetchall()

In [13]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [14]:
#sql's column names are .description()
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [15]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5
3     Atlanta     Georgia  1.25  6
4  Tallahasse     Florida  2.60  3
5  Sacramento  California  1.70  5

## 2. read_sql() via SQLAlchemy third-party
* LEARN THIS MATERIAL

In [16]:
import sqlalchemy as sqla

database = sqla.create_engine('sqlite:///04_database.sqlite')

pd.read_sql('select * from test', database)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5
3     Atlanta     Georgia  1.25  6
4  Tallahasse     Florida  2.60  3
5  Sacramento  California  1.70  5